{
  "home": {
    "title": "Evelin Alvarado",
    "subtitle": "Desarrolladora Front-end / Tecnología Médica en Laboratorio Clínico y Anatomía Patológica ",
    "description": "Desarrolladora Front-end enfocada en mejora continua a través de proyectos personales. Comprometida con el perfeccionamiento constante de mis habilidades como programadora.",
    "about": "Sobre Mí",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "header": {
    "home": "Inicio"
  },
  "contact": {
    "title": "Hola.",
    "description": "¿Estás buscando a una desarrolladora Frontend comprometida para unirse a tu equipo? ¡Hablemos! ",
    "button": "E-mail",
    "text": "Encuéntrame en: ",
    "form": {
      "title": "Formulario de Contacto",
      "nameLabel": "Nombre",
      "emailLabel": "E-mail",
      "messageLabel": "Mensaje",
      "sendButton": "Enviar",
      "emailSent": "¡Correo Enviado!",
      "requiredError": "Este campo es obligatorio",
      "invalidEmailError": "E-mail inválido"
    }
  },
  "about": {
    "title": "Sobre Mí.",
    "subtitle": "¡Hola! soy Evelin",
    "span_1": " Tecnóloga Médica en Laboratorio Clínico ",
    "description_1": "apasionada por la ciencia que recientemente incursionó en el mundo del ",
    "span_2": "desarrollo frontend ",
    "description_2": "a partir de junio de 2023. Estoy entusiasmada por continuar creciendo y aportando al campo tecnológico con todo mi esfuerzo y compromiso.",
    "description_3": "Mi trayectoria en el ámbito de la salud me ha brindado habilidades en ",
    "span_3": "gestión de laboratorio, liderazgo de equipos y redacción especializada ",
    "description_4": ". Sin embargo, mi interés por la programación me condujo hacia el desarrollo frontend.",
    "description_5": "El año pasado realicé el ",
    "span_4": "bootcamp de Oracle - Alura Latam del programa ONE (Oracle Next Education), ",
    "description_7": "enfocado en ",
    "link_1": "Frontend",
    "description_8": " y ",
    "link_2": "React",
    "description_9": ". En la actualidad, estoy explorando tecnologías como Tailwind CSS o TypeScript y dedicando tiempo a proyectos personales para fortalecer mis habilidades. Busco oportunidades que me permitan seguir aprendiendo y evolucionando.",
    "description_10": "Fuera del ámbito profesional, disfruto de la compañía de mis gatos y soy una entusiasta del canto. En mis momentos libres, disfruto viendo series, escuchando podcasts y tomando café americano en las tardes frías de invierno. También me apasiona descubrir culturas y tradiciones de todo el mundo. Así mantengo un equilibrio entre mi carrera y bienestar."
  },
  "projects": {
    "title": "Projectos.",
    "card": [
      {
        "id": "002",
        "image": "/assets/images/projects/decrypt-and-encrypt-text.jpg",
        "title": "Decrypt and Encrypt Text",
        "tech": "HTML5 / CSS3 / JavaScript",
        "description": "Este fue mi primer proyecto individual, una herramienta para intercambiar mensajes secretos usando claves de encriptación simples. Su objetivo fue aplicar habilidades aprendidas en el Bootcamp de Front-end de Alura en HTML, CSS, JavaScript y herramientas ágiles como Trello y Figma. La herramienta transforma texto original en un formato diferente basado en claves de encriptación. Incluye una función para copiar texto encriptado o desencriptado al portapapeles fácilmente.",
        "github": "https://github.com/EvelinAlvarado/encrypt-and-decrypt-text",
        "live_project": "https://evelinalvarado.github.io/encrypt-and-decrypt-text/"
      },
      {
        "id": "003",
        "image": "/assets/images/projects/travel-website-video-slider.gif",
        "title": "Responsive Travel Website with Background Video Slider",
        "tech": "HTML5 / CSS3 / JavaScript",
        "description": "En este proyecto, aprendí a crear un diseño web visualmente atractivo utilizando HTML, CSS y JavaScript. El sitio web cuenta con un slider de video de fondo que incluye botones de navegación para explorar cada diapositiva de manera fluida, gracias a la magia de JavaScript. Las transiciones suaves entre diapositivas se lograron utilizando la propiedad clip-path.",
        "github": "https://github.com/EvelinAlvarado/travel-website-video-slider",
        "live_project": "https://evelinalvarado.github.io/travel-website-video-slider/"
      },
      {
        "id": "004",
        "image": "/assets/images/projects/user-card-dark-light-mode-toggle.gif",
        "title": "User Card with Light & Dark Mode Toggle",
        "tech": "HTML5 / CSS3 / JavaScript",
        "description": "En mi proyecto \"User Card with Light & Dark Mode Toggle\", quise practicar CSS Flexbox y el uso de variables en CSS. Este proyecto incluye una tarjeta de usuario donde puedes ver el nombre, el rol y los enlaces a redes sociales del usuario. ¿Lo mejor? Puedes cambiar fácilmente entre modos claro y oscuro con un simple interruptor, haciendo que sea tanto atractivo visualmente como fácil de usar. Es una demostración sencilla de cómo HTML, CSS y JavaScript pueden unirse para crear una interfaz de usuario interactiva y dinámica.",
        "github": "https://github.com/EvelinAlvarado/dark-and-light-mode-toggle-user-card",
        "live_project": "https://evelinalvarado.github.io/dark-and-light-mode-toggle-user-card/"
      },
      {
        "id": "005",
        "image": "/assets/images/projects/todo-app.jpg",
        "title": "TODO App",
        "tech": "HTML5 / CSS3 / JavaScript",
        "description": "Una aplicación de TODO simple para ayudarte a gestionar tus tareas diarias de manera eficiente. Puedes agregar nuevas tareas rápidamente, marcarlas como completadas y eliminarlas una vez que las hayas hecho. Este proyecto fue parte del bootcamp de Oracle - Alura Latam, donde uno de los principales objetivos era practicar la manipulación del DOM. A través de este proyecto, mejoré mis habilidades en JavaScript, especialmente en la manipulación del DOM para crear interfaces de usuario dinámicas e interactivas.",
        "github": "https://github.com/EvelinAlvarado/task-list-dom-js-project-alura-oracle",
        "live_project": "https://evelinalvarado.github.io/task-list-dom-js-project-alura-oracle/"
      },
      {
        "id": "006",
        "image": "/assets/images/projects/testimonial-app-clone.jpg",
        "title": "Testimonial App Clone",
        "tech": "HTML5 / CSS3 / JavaScript / React",
        "description": "Este proyecto es un clon de una aplicación de testimonios que muestra comentarios de ex alumnos de freeCodeCamp. Fue desarrollado como parte del curso de React de freeCodeCamp. El Componente de Testimonio es un componente reutilizable de React diseñado para mostrar cada testimonio. Los testimonios están codificados estáticamente dentro del componente para simplificar su implementación. Este proyecto representa mis primeros pasos en el desarrollo con React, donde adquirí experiencia práctica en la construcción de componentes reutilizables y en la gestión del estado dentro de una aplicación React.",
        "github": "https://github.com/EvelinAlvarado/project1-clon-de-testimonios-de-freecodecamp/tree/main",
        "live_project": "https://project1-clon-de-testimonios-de-freecodecamp.vercel.app/"
      },
      {
        "id": "007",
        "image": "/assets/images/projects/click-counter.jpg",
        "title": "Click Counter",
        "tech": "HTML5 / CSS3 / JavaScript / React",
        "description": "Este proyecto es una aplicación sencilla de contador de clics desarrollada para aprender y demostrar el uso de useState en React. Permite a los usuarios incrementar un contador con cada clic y restablecerlo a cero. Las características principales incluyen la capacidad de incrementar el contador haciendo clic en un botón y reiniciarlo utilizando otro botón. Este proyecto formó parte del curso de React de freeCodeCamp, donde adquirí experiencia práctica con el hook useState de React.",
        "github": "https://github.com/EvelinAlvarado/project2-click-counter",
        "live_project": "https://project2-click-counter.vercel.app/"
      },
      {
        "id": "008",
        "image": "/assets/images/projects/project-interactive-calculator.jpg",
        "title": "Interactive Calculator",
        "tech": "HTML5 / CSS3 / JavaScript / React / Math.js",
        "description": "Este proyecto demuestra cómo crear una calculadora funcional utilizando React, incorporando componentes, gestión de estado y Math.js para los cálculos matemáticos. El objetivo es solidificar la comprensión de los conceptos de React mientras se construye una herramienta práctica e interactiva, permitiendo a los usuarios realizar operaciones aritméticas básicas como suma, resta, multiplicación y división. La aplicación también cuenta con un botón de borrado dedicado para reiniciar la entrada actual.",
        "github": "https://github.com/EvelinAlvarado/project3-interactive-calculator",
        "live_project": "https://project3-interactive-calculator.vercel.app/"
      },
      {
        "id": "009",
        "image": "/assets/images/projects/todo-list-react.jpg",
        "title": "TODO List",
        "tech": "HTML5 / CSS3 / JavaScript / React",
        "description": "Este proyecto es una aplicación sencilla de Lista de Tareas que desarrollé para mejorar mis habilidades en React. Con esta aplicación, puedes agregar nuevas tareas fácilmente, marcarlas como completadas y eliminarlas una vez que las hayas terminado. Utilicé react-icons para que los iconos de las tareas se vean geniales y la biblioteca uuid para asignar a cada tarea un identificador único. Trabajar en este proyecto fue una forma fantástica de aprender más sobre React y crear algo útil para la vida cotidiana.",
        "github": "https://github.com/EvelinAlvarado/project4-to-do-list-app",
        "live_project": "https://project4-to-do-list-app.vercel.app/"
      },
      {
        "id": "011",
        "image": "/assets/images/projects/login-and-sign-up-form-using-reactjs.jpg",
        "title": "Sign In & Sign Up Form",
        "tech": "HTML5 / CSS3 / JavaScript / React / Vite",
        "description": "Este proyecto presenta un formulario de inicio de sesión y registro construido con ReactJS. Su objetivo principal es aprender y practicar el uso de componentes funcionales en React, así como gestionar props y funciones de manera efectiva. El proyecto utiliza Vite para la configuración del proyecto React. Las características principales incluyen un formulario interactivo de inicio de sesión y registro, y el cambio dinámico entre las funcionalidades de 'Inicio de sesión' y 'Registro' utilizando componentes de React. Se incluyen Bootstrap Icons para mejorar la apariencia visual.",
        "github": "https://github.com/EvelinAlvarado/login-and-sign-up-form-using-reactjs",
        "live_project": "https://login-and-sign-up-form-using-reactjs.vercel.app/"
      },
      {
        "id": "012",
        "image": "/assets/images/projects/team-member-info-form-and-card-generator.jpg",
        "title": "Org - Team Management",
        "tech": "HTML5 / CSS3 / JavaScript / React / Vite / Figma",
        "description": "Org es una plataforma fácil de usar que te ayuda a gestionar y organizar tu equipo de manera eficiente. Agrega nuevos miembros con información básica como nombre, posición y foto. Crea equipos personalizados con colores únicos para una rápida identificación y destaca a los miembros favoritos para un acceso rápido. Este proyecto es parte del curso de React de Alura - Oracle, con recursos de Figma e incluye react-icons y uuid.",
        "github": "https://github.com/EvelinAlvarado/team-member-info-form-and-card-generator",
        "live_project": "https://org-team-management.vercel.app/"
      },
      {
        "id": "013",
        "image": "/assets/images/projects/petshop-project-crud-js-async.jpg",
        "title": "Petshop CRUD Project",
        "tech": "HTML5 / CSS3 / JavaScript / API / JSON Server ",
        "description": "Este proyecto es una sencilla aplicación CRUD (Crear, Leer, Actualizar, Eliminar) diseñada para gestionar perfiles de clientes en una tienda de mascotas. El objetivo principal era aprender a realizar operaciones CRUD, interactuar con una API RESTful usando fetch y manejar tareas asincrónicas de manera eficiente con async/await y bloques try-catch. La aplicación te permite crear, leer, actualizar y eliminar perfiles de clientes de manera fluida, manteniendo el código limpio y manejable.",
        "github": "https://github.com/EvelinAlvarado/petshop-project-crud-js-async",
        "live_project": "https://petshop-project-crud-js-async.vercel.app/"
      },
      {
        "id": "015",
        "image": "/assets/images/projects/petshop-project-react-router-spa.jpg",
        "title": "Pet News Blog",
        "tech": "HTML5 / CSS3 / JavaScript / React / Vite / Axios / React Router / JSON Server",
        "description": "Este proyecto es un blog de noticias de mascotas, parte del curso de React en Alura Latam. Incluye una variedad de artículos sobre noticias relacionadas con mascotas, con una navegación sencilla a través de diferentes categorías y subcategorías. Si llegas a una ruta inexistente, verás una página 404 personalizada. La aplicación utiliza axios para obtener datos, react-router-dom para una navegación fluida y json-server para crear una API REST simulada. Trabajar en este proyecto me ayudó a familiarizarme con los hooks useState y useEffect, React Router y la construcción de una Single Page Application (SPA).",
        "github": "https://github.com/EvelinAlvarado/petshop-project-react-router-spa",
        "live_project": "https://petshop-project-react-router-spa.vercel.app/"
      },
      {
        "id": "017",
        "image": "/assets/images/projects/smart-bank-react-styled-components.jpg",
        "title": "Smart Bank",
        "tech": "HTML5 / CSS3 / JavaScript / React / Vite / Styled-Components",
        "description": "La aplicación de Smart Bank te permite hacer varias cosas como revisar el saldo de tu cuenta, ver los gastos recientes y cambiar entre temas claros y oscuros. La aplicación utiliza Styled-Components para hacer que el estilo de los componentes de React sea modular y reutilizable. El objetivo principal de este proyecto era practicar con Styled-Components y mejorar mis habilidades en React y JavaScript.",
        "github": "https://github.com/EvelinAlvarado/smart-bank-react-styled-components",
        "live_project": "https://smart-bank-react-styled-components.vercel.app/"
      },
      {
        "id": "018",
        "image": "/assets/images/projects/form-delivery-food-react.jpg",
        "title": "Delivery Food Form Validation with JavaScript",
        "tech": "HTML5 / CSS3 / JavaScript / React / Vite / Styled-Components / Material UI",
        "description": "Delivery Food Form Validation with JavaScript muestra cómo implementar la validación de formularios en una aplicación React usando JavaScript puro. Este proyecto fue desarrollado para practicar la gestión de estado con useState y mejorar las habilidades de validación de formularios. Incluye funciones personalizadas de JavaScript para la validación de formularios, gestión de estado con useState y un formulario de varios pasos con validación en cada uno.",
        "github": "https://github.com/EvelinAlvarado/form-delivery-food-react-usecontext-customhooks",
        "live_project": "https://form-delivery-food-react-usecontext-customhooks.vercel.app/"
      },
      {
        "id": "019",
        "image": "/assets/images/projects/form-react-material-ui-components.jpg",
        "title": "React Form Validation with React Hook Form",
        "tech": "HTML5 / CSS3 / JavaScript / React / Vite / Styled-Components / React Hook Form / Material UI",
        "description": "React Form Validation muestra cómo implementar la validación de formularios utilizando React Hook Form, styled-components para estilos personalizados y Material-UI para componentes de interfaz de usuario. Presenta técnicas efectivas de validación de formularios a través de React Hook Form, styled-components y Material-UI para diseño responsivo. Este proyecto me permitió practicar React, JavaScript y styled-components, centrándome en aprender métodos eficientes de validación de formularios con React Hook Form.",
        "github": "https://github.com/EvelinAlvarado/form-react-material-ui-components",
        "live_project": "https://form-validation-react-alpha.vercel.app/"
      },
      {
        "id": "021",
        "image": "/assets/images/projects/movieshub-react.jpg",
        "title": "MoviesHub",
        "tech": "HTML5 / CSS3 / JavaScript / React / Vite / Styled-Components / React Hook Form / Axios / React Router / JSON Server / Trello",
        "description": "MoviesHub es una aplicación web responsive desarrollada como parte de un desafío durante el curso de React en Alura Latam. El proyecto permite a los usuarios gestionar películas y categorías mediante la adición, edición y eliminación de entradas, todo presentado en una interfaz interactiva y visualmente atractiva. El diseño e implementación de la aplicación siguieron pasos delineados en Trello. Las características principales incluyen sliders sincronizados para películas y categorías, formularios para crear nuevas entradas y carga dinámica de datos desde un servidor JSON. Las tecnologías utilizadas incluyen react-hook-form para el manejo de formularios y react-slick para crear componentes de carrusel/slider en React, además del uso de uuid.",
        "github": "https://github.com/EvelinAlvarado/movieshub-react",
        "live_project": "https://movieshub-react.vercel.app/"
      },
      {
        "id": "022",
        "image": "/assets/images/projects/task-list-react-ts.jpg",
        "title": "Task List App",
        "tech": "HTML5 / CSS3 / JavaScript / React / Vite / TypeScript",
        "description": "Task List App es una aplicación web sencilla desarrollada como proyecto inicial utilizando TypeScript. Permite a los usuarios gestionar tareas añadiendo nuevas y eliminándolas de la lista. Este proyecto tiene como objetivo familiarizar al desarrollador con la sintaxis de TypeScript, las anotaciones de tipos y el uso general dentro de una aplicación React.",
        "github": "https://github.com/EvelinAlvarado/task-list-react-ts",
        "live_project": "https://task-list-react-ts.vercel.app/"
      },
      {
        "id": "023",
        "image": "/assets/images/projects/social-media-dashboard-with-theme-switcher.jpg",
        "title": "Social Media Dashboard with Theme Switcher",
        "tech": "HTML5 / CSS3 / JavaScript / React / Vite / Tailwind CSS",
        "description": "Este proyecto es un panel de redes sociales que permite a los usuarios seguir sus seguidores y suscriptores en plataformas como Facebook, Twitter, Instagram y YouTube. El panel incluye un interruptor de temas para alternar entre temas claro y oscuro y mejorar la experiencia del usuario. El diseño es adaptable, garantizando una visualización óptima en diversos dispositivos. Los datos del panel provienen de un archivo JSON y formaron parte del desafío de Frontend Mentor. El objetivo principal fue familiarizarme por primera vez con Tailwind CSS y aprender su implementación.",
        "github": "https://github.com/EvelinAlvarado/social-media-dashboard-with-theme-switcher",
        "live_project": "https://social-media-dashboard-with-theme-switcher-ruby.vercel.app/"
      },
      {
        "id": "035",
        "image": "/assets/images/projects/advice-generator-app.jpg",
        "title": "Advice Generator App",
        "tech": "HTML5 / CSS3 / JavaScript / React / Tailwind / API / Vite",
        "description": "Esta aplicación generadora de consejos, desarrollada como parte del desafío de Frontend Mentor, obtiene y muestra consejos aleatorios de Advice Slip JSON API. Los usuarios pueden obtener fácilmente nuevos consejos con un clic de botón. La aplicación cuenta con una interfaz fácil de usar y está diseñada para ser totalmente responsiva. El objetivo principal de este proyecto fue mejorar las habilidades en el uso de Tailwind CSS y en el consumo de APIs.",
        "github": "https://github.com/EvelinAlvarado/advice-generator-app",
        "live_project": "https://advice-generator-app-one-sooty.vercel.app/"
      },
      {
        "id": "036",
        "image": "/assets/images/projects/news-homepage.jpg",
        "title": "News Website",
        "tech": "HTML5 / CSS3 / JavaScript / React / Tailwind / React Icons / Vite",
        "description": "Este proyecto es un sitio web de noticias responsivo que incluye una sección destacada para artículos principales, resaltando noticias importantes, un contenedor dinámico de noticias mostrando los artículos más recientes, y una sección con los artículos más populares. La creación de este sitio web tuvo como objetivo principal mejorar en el uso de Tailwind CSS, una habilidad que estaba comenzando a desarrollar. Fue desarrollado como parte del desafío de Frontend Mentor.",
        "github": "https://github.com/EvelinAlvarado/news-homepage",
        "live_project": "https://news-homepage-bay-eight.vercel.app/"
      },
      {
        "id": "038",
        "image": "/assets/images/projects/sunnyside-agency-landing-page.jpg",
        "title": "Sunnyside Agency Landing Page",
        "tech": "HTML5 / CSS3 / JavaScript / React / Tailwind / React Icons / Vite",
        "description": "Este proyecto es una página de inicio responsiva para Sunnyside Agency, creada como parte del desafío de Frontend Mentor. Incluye un encabezado completo con menú de navegación, una página principal atractiva, descripciones detalladas de servicios, testimonios de clientes, una galería dinámica que muestra su trabajo y un pie de página con enlaces adicionales e integración de redes sociales. La página de inicio está diseñada para ofrecer un diseño visual atractivo y contenido informativo en diferentes dispositivos.",
        "github": "https://github.com/EvelinAlvarado/sunnyside-agency-landing-page",
        "live_project": "https://sunnyside-agency-landing-page-gamma-eight.vercel.app/"
      },
      {
        "id": "040",
        "image": "/assets/images/projects/food-delivery-app-responsive.jpg",
        "title": "Food Delivery App",
        "tech": "HTML5 / CSS3 / JavaScript / React / Tailwind CSS/ React Icons / Vite",
        "description": "Food Delivery App es una aplicación web que permite a los usuarios explorar una gran variedad de opciones de comida, ver información detallada de cada artículo, agregarlos a su carrito y proceder al pago. Los usuarios pueden navegar fácilmente por diferentes categorías de alimentos, gestionar su carrito añadiendo o eliminando artículos, y ver el monto total a pagar. La aplicación está diseñada para ofrecer una experiencia fluida y responsiva en todos los dispositivos.",
        "github": "https://github.com/EvelinAlvarado/food-delivery-app-responsive",
        "live_project": "https://food-delivery-app-responsive.vercel.app/"
      },
      {
        "id": "041",
        "image": "/assets/images/projects/portfolio-project.gif",
        "title": "Portfolio",
        "tech": "HTML5 / CSS3 / JavaScript / React / Tailwind CSS / React Icons / Vite / API / Axios / Styled-Components / Material UI",
        "description": "Este portfolio fue diseñado para mostrar mis proyectos y habilidades en desarrollo web. Con un diseño moderno y adaptable a cualquier dispositivo, encontrarás una página de inicio con una breve presentación, una sección sobre mí, una galería de mis proyectos recientes con enlaces, y una página de contacto con un formulario fácil de usar. Además, puedes cambiar entre modo claro y oscuro según tu preferencia.",
        "github": "https://github.com/EvelinAlvarado/portfolio",
        "live_project": "https://evelinalvarado.vercel.app/"
      },
      {
        "id": "043",
        "image": "/assets/images/projects/e-commerce-application.png",
        "title": "E-commerce FashionHub",
        "tech": "HTML5 / CSS3 / JavaScript / TypeScript / React / Tailwind CSS / React Hook Form / Material UI / Vite / Firestore",
        "description": "Desarrollé una plataforma de comercio electrónico simple para practicar la creación de tiendas en línea. Usando Firebase por primera vez, me centré en el almacenamiento y la recuperación de datos, incluyendo la gestión de listados de productos, interacciones de usuarios y gestión de pedidos. Este proyecto fue una excelente oportunidad para aprender Firebase y mejorar mis habilidades en la integración de bases de datos en tiempo real en mis proyectos.",
        "github": "https://github.com/EvelinAlvarado/e-commerce-react-firebase",
        "live_project": "https://e-commerce-react-firebase-two.vercel.app/"
      },
      {
        "id": "045",
        "image": "/assets/images/projects/memories-album-app.jpg",
        "title": "Memories Album App",
        "tech": "HTML5 / CSS3 / JavaScript / TypeScript / React / Tailwind CSS / Firestore / API / Axios / React Router / React Hook Form / Material UI / Figma / Vite ",
        "description": "El Memories Album App es una aplicación desarrollada con React y TypeScript que permite a los usuarios organizar y mostrar álbumes de fotos, filtrar imágenes por categorías, y agregar nuevas fotos mediante un formulario. La versión desplegada utiliza Firestore para gestionar los datos, mientras que la rama de desarrollo local usa JSON Server. El diseño de la aplicación está inspirado en un proyecto de Figma, usando el developer mode para implementarlo.",
        "github": "https://github.com/EvelinAlvarado/memories-album-app",
        "live_project": "https://memorylane-album-app.vercel.app/"
      },
      {
        "id": "047",
        "image": "/assets/images/projects/camp-travel-project.png",
        "title": "Travel Camp Landing Page",
        "tech": "HTML5 / CSS3 / JavaScript / TypeScript / React / Tailwind CSS / Next.js / Jest / Testing Library",
        "description": "Travel Camp es una aplicación de muestra para los amantes del campamento y la naturaleza, mostrando un diseño responsive creado con Next.js. Este proyecto me ayudó a practicar Jest y Testing Library para las pruebas, mientras usaba Tailwind CSS para un estilo moderno. La página es totalmente responsiva y utiliza componentes reutilizables para una mejor mantenibilidad.",
        "github": "https://github.com/EvelinAlvarado/travel-camp-app-nextjs",
        "live_project": "https://travel-camp-app-nextjs.vercel.app/"
      },
      {
        "id": "049",
        "image": "/assets/images/projects/personal-budget-assistant-project.gif",
        "title": "Personal Budget Assistant",
        "tech": "React / Material-UI / Recharts / Nanostores / Axios / API",
        "description": "Personal Budget Assistant es una aplicación diseñada para ayudar a los usuarios a realizar un seguimiento de sus gastos, gestionar presupuestos y visualizar su estado financiero a través de gráficos interactivos. Desarrollada durante la hackathon de Nuwe y CaixaBank Tech, este proyecto me permitió implementar componentes responsivos y reutilizables, centrándome en ofrecer una experiencia de usuario fluida. Fue un gran desafío y aprendizaje utilizando herramientas modernas como Recharts.",,
        "github": "https://github.com/EvelinAlvarado/hackathon-caixabank-frontend-react-finassist",
        "live_project": "https://hackathon-caixabank.vercel.app/login/"
      }
    ]
  }
}
